tutorials/incompressible/threeFingersFourRadii/demo/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
    version	2.0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          2349;
        startFace       136311;
    }
    outlet
    {
        type            patch;
        nFaces          2349;
        startFace       138660;
    }
    defaultName
    {
        type            patch;
        nFaces          4560;
        startFace       141009;
    }
)

// ************************************************************************* //
